redis_benchmark/test/withPolicy6_1000000.txt
====== GET ======
  1000000 requests completed in 11.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.103 milliseconds (cumulative count 1)
50.000% <= 0.303 milliseconds (cumulative count 731050)
75.000% <= 0.311 milliseconds (cumulative count 847440)
87.500% <= 0.319 milliseconds (cumulative count 888991)
93.750% <= 0.359 milliseconds (cumulative count 939512)
96.875% <= 0.423 milliseconds (cumulative count 971220)
98.438% <= 0.471 milliseconds (cumulative count 985688)
99.219% <= 0.575 milliseconds (cumulative count 992229)
99.609% <= 0.727 milliseconds (cumulative count 996166)
99.805% <= 0.823 milliseconds (cumulative count 998093)
99.902% <= 0.943 milliseconds (cumulative count 999053)
99.951% <= 1.103 milliseconds (cumulative count 999514)
99.976% <= 1.295 milliseconds (cumulative count 999765)
99.988% <= 1.943 milliseconds (cumulative count 999878)
99.994% <= 3.047 milliseconds (cumulative count 999939)
99.997% <= 4.039 milliseconds (cumulative count 999970)
99.998% <= 4.431 milliseconds (cumulative count 999985)
99.999% <= 4.631 milliseconds (cumulative count 999993)
100.000% <= 4.711 milliseconds (cumulative count 999997)
100.000% <= 4.759 milliseconds (cumulative count 999999)
100.000% <= 4.791 milliseconds (cumulative count 1000000)
100.000% <= 4.791 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 1)
0.003% <= 0.207 milliseconds (cumulative count 34)
73.105% <= 0.303 milliseconds (cumulative count 731050)
96.200% <= 0.407 milliseconds (cumulative count 961999)
98.862% <= 0.503 milliseconds (cumulative count 988615)
99.354% <= 0.607 milliseconds (cumulative count 993544)
99.588% <= 0.703 milliseconds (cumulative count 995879)
99.784% <= 0.807 milliseconds (cumulative count 997838)
99.876% <= 0.903 milliseconds (cumulative count 998761)
99.932% <= 1.007 milliseconds (cumulative count 999320)
99.951% <= 1.103 milliseconds (cumulative count 999514)
99.967% <= 1.207 milliseconds (cumulative count 999668)
99.977% <= 1.303 milliseconds (cumulative count 999769)
99.980% <= 1.407 milliseconds (cumulative count 999795)
99.984% <= 1.503 milliseconds (cumulative count 999837)
99.985% <= 1.607 milliseconds (cumulative count 999851)
99.986% <= 1.703 milliseconds (cumulative count 999859)
99.987% <= 1.807 milliseconds (cumulative count 999869)
99.987% <= 1.903 milliseconds (cumulative count 999875)
99.988% <= 2.007 milliseconds (cumulative count 999884)
99.989% <= 2.103 milliseconds (cumulative count 999890)
99.994% <= 3.103 milliseconds (cumulative count 999943)
99.997% <= 4.103 milliseconds (cumulative count 999973)
100.000% <= 5.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 83423.70 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.308     0.096     0.303     0.383     0.535     4.791